[
  {
    "title": "Demo: PhoneLets - Offloading the Phone off your Phone for Energy, Cost and Network Load Optimization",
    "authors": "Andrius Aucinas, Jon Crowcroft",
    "venue": "To Appear: MobiCom, Maui, Hawaii, USA, September 2014",
    "pdf_link": "files/phonelets.pdf",
    "project_link": "http://phonelets.smart-e.org",
    "abstract_id": "mobicom_phonelets",
    "abstract": "This demo presents how phone functionality can be offloaded from a smartphone over wireless link to a PhoneLet by sharing one SIM card across multiple devices. This can lead to significant cost and network load reductions by decreasing the number of simultaneously connected mobile clients. Furthermore, it can save energy for the mobile user when connected to a powered PhoneLet by offloading phone functionality. It absorbs the energy cost of online presence and inefficient mobile applications' communication patterns, instead providing connectivity for the user over a WiFi link."
  },
  {
    "title": "Staying online while mobile: The hidden costs",
    "authors": "Andrius Aucinas, Narseo Vallina-Rodriguez, Yan Grunenberger, Vijay Erramilli,  Konstantina Papagiannaki, Jon Crowcroft, David Wetherall",
    "venue": "ACM CoNEXT, Santa Barbara, USA, December 2013",
    "project_link": "http://rilanalyzer.smart-e.org",
    "abstract_id": "conext_rilanalyzer",
    "abstract": "Mobile phones in the 3G/4G era enable us to stay connected not only to the voice network, but also to online services like social networks. In this paper, we study the energy and net- work costs of mobile applications that provide continuous online presence (e.g. WhatsApp, Facebook, Skype). By combining measurements taken on the mobile and the cellular access network, we reveal a detailed picture of the mechanisms selected to implement online presence, along with their effect on handset energy consumption and network signaling traffic. We are surprised to find that simply having idle online presence apps on a mobile (that maintain connectivity in the background, with no user interaction) can drain the handset battery nine times more quickly. This high cost is partly due to online presence apps that are excessively “chatty”, in particular when their design philosophy stems from a similar desktop version. However, we also find that the cost of background app traffic is disproportionately large because of cross-layer interactions in which the traffic unintentionally triggers the promotion of cellular network states. Our experiments show that both of these effects can be overcome with careful implementation. We posit that a two-way push notification system, with messages being sent at a low (regular) frequency and low volume by a network-aware sender, can alleviate many of the costs."
  },
  {
    "title": "RILAnalyzer: a Comprehensive 3G Monitor On Your Phone",
    "authors": "Narseo Vallina-Rodriguez, Andrius Aucinas, Mario Almeida, Yan Grunenberger, Konstantina Papagiannaki and Jon Crowcroft",
    "venue": "IMC 2013, Barcelona, Spain, September 2013",
    "project_link": "http://rilanalyzer.smart-e.org",
    "abstract_id": "imc_rilanalyzer",
    "abstract": "The popularity of smartphones, cloud computing, and the app store model have led to cellular networks being used in a completely different way than what they were designed for. As a consequence, mobile applications impose new challenges in the design and efficient configuration of constrained networks to maximize application’s performance. Such difficulties are largely caused by the lack of cross-layer understanding of interactions between different entities - applications, devices, the network and its management plane. In this paper, we describe RILAnalyzer, an open-source tool that provides mechanisms to perform network analysis from within a mobile device. RILAnalyzer is capable of recording low-level radio information and accurate cellular net- work control-plane data, as well as user-plane data. We demonstrate how such data can be used to identify previously overlooked issues. Through a small user study across four cellular network providers in two European countries we infer how different network configurations are in reality and explore how such configurations interact with application logic, causing network and energy overheads."
  },
  {
    "title": "Signposts: End-to-End Networking in a World of Middleboxes",
    "authors": "Andrius Aucinas, Amir Chaudhry, Jon Crowcroft, Sebastian Probst Eide, Steve Hand, Anil Madhavapeddy, Andrew W. Moore, Charalampos Rotsos, Narseo Vallina-Rodriguez",
    "venue": "SIGCOMM 2012 (demo track), Helsinki, Finland, August 2012",
    "abstract_id": "sigcomm_signposts",
    "pdf_link": "http://conferences.sigcomm.org/sigcomm/2012/paper/sigcomm/p83.pdf",
    "poster_link": "http://anil.recoil.org/papers/2012-sigcomm-signposts-poster.pdf",
    "abstract": "This demo presents Signposts, a system to provide users with a secure, simple mechanism to establish and maintain communication channels between their personal cloud of named devices. Signpost names exist in the DNSSEC hierarchy, and resolve to secure end-points when accessed by existing DNS clients. Signpost clients intercept user connection intentions while adding privacy and multipath support. Signpost servers co-ordinate clients to dynamically discover routes and overcome the middleboxes that pervade modern edge networks. The demo will show a simple scenario where an individual's personal devices (phone, laptop) are interconnected via Signposts while sitting on different networks behind various middleboxes. As a result they will be able to fetch and push data between each other, demonstrated by, e.g., simple web browsing, even as the network configuration changes."
  },
  {
    "title": "ThinkAir: Dynamic resource allocation and parallel execution in the cloud for mobile code offloading",
    "authors": "Sokol Kosta, Andrius Aucinas, Pan Hui, Richard Mortier, and Xinwen Zhang",
    "venue": "In Proceedings of IEEE INFOCOM 2012, Orlando, Florida USA, March 2012",
    "pdf_link": "files/thinkair.pdf",
    "abstract_id": "infocom_thinkair"
  },
  {
    "title": "Digital video stabilization",
    "authors": "Andrius Aucinas",
    "venue": "Computer Science Tripos Part II dissertation, Cambridge, UK, July 2011",
    "pdf_link": "files/partII_aucinas.pdf",
    "abstract_id": "undergrad_thesis",
    "abstract": "This dissertation describes the creation of a digital video stabilization system for correcting unwanted jitters in digital video footage. It describes a distinctive image feature based system and quantitatively measures performance of such system."
  },
  {
    "title": "EmotionSense: A Mobile Phones based Adaptive Platform for Experimental Social Psychology Research",
    "authors": "Kiran K. Rachuri, Mirco Musolesi, Cecilia Mascolo, Peter J. Rentfrow, Chris Longworth, Andrius Aucinas",
    "venue": "In Proceedings of UbiComp 2010, Copenhagen, Denmark. September 2010",
    "pdf_link": "http://www.cl.cam.ac.uk/~cm542/papers/Ubicomp10.pdf",
    "project_link": "http://emotionsense.org",
    "abstract_id": "ubicomp_abstract",
    "abstract": "Today’s mobile phones represent a rich and powerful computing platform, given their sensing, processing and communication capabilities. Phones are also part of the everyday life of billions of people, and therefore represent an exceptionally suitable tool for conducting social and psychological experiments in an unobtrusive way.</p> <p>In this paper we illustrate EmotionSense, a mobile sensing platform for social psychology studies based on mobile phones. Key characteristics include the ability of sensing individual emotions as well as activities, verbal and proximity interactions among members of social groups. Moreover, the system is programmable by means of a declarative language that can be used to express adaptive rules to improve power saving. We evaluate a system prototype on Nokia Symbian phones by means of several small-scale experiments aimed at testing performance in terms of accuracy and power consumption. Finally, we present the results of real deployment where we study participants emotions and interactions. We cross-validate our measurements with the results obtained through questionnaires ﬁlled by the users, and the results presented in social psychological studies using traditional methods. In particular, we show how speakers and participants’ emotions can be automatically detected by means of classiﬁers running locally on off-the-shelf mobile phones, and how speaking and interactions can be correlated with activity and location measures."
  }
]
